using UnityEngine;

namespace MappingHelper
{
    public class CoroutineRunner : MonoBehaviour
    {
        //たての自分で偽り
        //本当の欲望
        //見つけられなぃふりをして
        //見分の
        //創作の限界を探すのいか
        //見つかると信じて
        //苦しくて
        //途方もない
        //感情を受けなけれは
        //届かないけど（痛みをも）
        //いつか
        //限界を（完成を）
        //超えれると信じて
        //（迎えられると信じて）
        //狂つても
        //続けて行くの
        //届くと信じて
        //美しい夕燒けの下で
        //こぢんまりとした雄大な小さな村
        //その小さな村は大きな未来を見たし
        //やかてその未来はますます惨憺たる現実になっていく
        //暖かかった穂名坂村は引き裂かれた
        //世界は滅亡と手を握った
        //その滅亡は今や薄暗い世界の甯判を下す
        //そうして、世界はついに滅亡の目を関けてしまった
        //作りたての 自分で偽り
        //本当の欲望を
        //見つけられないふりをして
        //創作の限界を探すのいか
        //見つかると信じて
        //苦しくて
        //世界の滅亡は結局フしイヤ一、あをたに□てなかつた
        //穗坂町と世界はまた美しい夕陽燒けを取り□した
        //□□と手を掘つた訷は世界から追放され、□たい雨は□いを□やした
        //現在，穗坂村は消えた狀態という
    }
}
